tonchval2307/Codigos-Arduino/PIC16F877A-PIC18F4550/Practica1Yess.X/system.h
/* 
 * File:   system.h
 * Author: c4810
 *
 * Created on August 8, 2019, 5:08 PM
 */

#ifndef SYSTEM_H
#define	SYSTEM_H
#include <xc.h> // include processor files - each processor file is guarded.  
#include <stdint.h>
#include <stdio.h>

#pragma config PLLDIV = 5       // PLL Prescaler Selection bits (No prescale (4 MHz oscillator input drives PLL directly))
#pragma config CPUDIV = OSC3_PLL4// System Clock Postscaler Selection bits ([Primary Oscillator Src: /1][96 MHz PLL Src: /2])
#pragma config USBDIV = 1       // USB Clock Selection bit (used in Full-Speed USB mode only; UCFG:FSEN = 1) (USB clock source comes directly from the primary oscillator block with no postscale)

// CONFIG1H
#pragma config FOSC = HSPLL_HS  // Oscillator Selection bits (XT oscillator, PLL enabled (XTPLL))
#pragma config FCMEN = OFF      // Fail-Safe Clock Monitor Enable bit (Fail-Safe Clock Monitor disabled)
#pragma config IESO = OFF       // Internal/External Oscillator Switchover bit (Oscillator Switchover mode disabled)

// CONFIG2L
#pragma config PWRT = OFF       // Power-up Timer Enable bit (PWRT disabled)
#pragma config BOR = OFF        // Brown-out Reset Enable bits (Brown-out Reset disabled in hardware and software)
#pragma config BORV = 3         // Brown-out Reset Voltage bits (Minimum setting)
#pragma config VREGEN = OFF     // USB Voltage Regulator Enable bit (USB voltage regulator disabled)

// CONFIG2H
#pragma config WDT = OFF        // Watchdog Timer Enable bit (WDT disabled (control is placed on the SWDTEN bit))
#pragma config WDTPS = 32768    // Watchdog Timer Postscale Select bits (1:32768)

// CONFIG3H
#pragma config CCP2MX = ON      // CCP2 MUX bit (CCP2 input/output is multiplexed with RC1)
#pragma config PBADEN = OFF     // PORTB A/D Enable bit (PORTB<4:0> pins are configured as digital I/O on Reset)
#pragma config LPT1OSC = OFF    // Low-Power Timer 1 Oscillator Enable bit (Timer1 configured for higher power operation)
#pragma config MCLRE = ON       // MCLR Pin Enable bit (MCLR pin enabled; RE3 input pin disabled)

// CONFIG4L
#pragma config STVREN = ON      // Stack Full/Underflow Reset Enable bit (Stack full/underflow will cause Reset)
#pragma config LVP = OFF        // Single-Supply ICSP Enable bit (Single-Supply ICSP disabled)
#pragma config ICPRT = OFF      // Dedicated In-Circuit Debug/Programming Port (ICPORT) Enable bit (ICPORT disabled)
#pragma config XINST = OFF      // Extended Instruction Set Enable bit (Instruction set extension and Indexed Addressing mode disabled (Legacy mode))

// CONFIG5L
#pragma config CP0 = OFF        // Code Protection bit (Block 0 (000800-001FFFh) is not code-protected)
#pragma config CP1 = OFF        // Code Protection bit (Block 1 (002000-003FFFh) is not code-protected)
#pragma config CP2 = OFF        // Code Protection bit (Block 2 (004000-005FFFh) is not code-protected)
#pragma config CP3 = OFF        // Code Protection bit (Block 3 (006000-007FFFh) is not code-protected)

// CONFIG5H
#pragma config CPB = OFF        // Boot Block Code Protection bit (Boot block (000000-0007FFh) is not code-protected)
#pragma config CPD = OFF        // Data EEPROM Code Protection bit (Data EEPROM is not code-protected)

// CONFIG6L
#pragma config WRT0 = OFF       // Write Protection bit (Block 0 (000800-001FFFh) is not write-protected)
#pragma config WRT1 = OFF       // Write Protection bit (Block 1 (002000-003FFFh) is not write-protected)
#pragma config WRT2 = OFF       // Write Protection bit (Block 2 (004000-005FFFh) is not write-protected)
#pragma config WRT3 = OFF       // Write Protection bit (Block 3 (006000-007FFFh) is not write-protected)

// CONFIG6H
#pragma config WRTC = OFF       // Configuration Register Write Protection bit (Configuration registers (300000-3000FFh) are not write-protected)
#pragma config WRTB = OFF       // Boot Block Write Protection bit (Boot block (000000-0007FFh) is not write-protected)
#pragma config WRTD = OFF       // Data EEPROM Write Protection bit (Data EEPROM is not write-protected)

// CONFIG7L
#pragma config EBTR0 = OFF      // Table Read Protection bit (Block 0 (000800-001FFFh) is not protected from table reads executed in other blocks)
#pragma config EBTR1 = OFF      // Table Read Protection bit (Block 1 (002000-003FFFh) is not protected from table reads executed in other blocks)
#pragma config EBTR2 = OFF      // Table Read Protection bit (Block 2 (004000-005FFFh) is not protected from table reads executed in other blocks)
#pragma config EBTR3 = OFF      // Table Read Protection bit (Block 3 (006000-007FFFh) is not protected from table reads executed in other blocks)

// CONFIG7H
#pragma config EBTRB = OFF      // Boot Block Table Read Protection bit (Boot block (000000-0007FFh) is not protected from table reads executed in other blocks)

#define _XTAL_FREQ 48000000
#define HIGH 1
#define LOW 0
#define OUTPUT 0
#define INPUT 1
/* Program Definitions*/
#define TRIS_SDI TRISB0 //MOSI
#define TRIS_SCK TRISB1 //SCK
#define TRIS_CS  TRISA5 //nSS
#define TRIS_SDO TRISC7 //MISO
#define ADCON0Reg 0
#define ADCON1Reg 1
#define ADCON2Reg 2
#define ENABLE 1
#define DISABLE 0
#define TMR2PS 16
#define PWM_FREQ 1000
#define PWM_MAX_DUTY (_XTAL_FREQ / (PWM_FREQ * TMR2PS))

void configuracionInicial(void);
void loop(void);
void setup(void);
void delay(const int milis);
void delayMicroseconds(const int micros);

void pinMode(char pin, char mode);
void digitalWrite(char pin, char mode);
char digitalRead(char pin);

void ADCConfig(void);
unsigned int analogRead(char pin);
void ADCSetParam(char reg, char  cmd);
//-------------------------------------//
//CCP Module Functions//
void CCPConfig(long pwm1, const int TMR2PRESCALE);
void CCPDisable(void);
void analogWrite(char pin, unsigned int value);
//---------------------------------------//
// Timers Configuration-------------------///
void TMR0Config(char mode);
double Time(void);
unsigned long milliseconds( unsigned long mil);
void TMR1Config(void);
double PulseIn(char pin);
double Frequency(void);
void TMR2Config(void);
void TMR3Config(void);
//------------------------------------------//
/* GPIO Parameters*/
void PORTSConfiguration(void);

//-----Push Buttons Reading-------//
char PBRead(char pin);
double rescale(double x, double in_min, double in_max, double out_min, double out_max);
/* Serial Comunication */
char SerialBegin(const long int baudRate);
void SerialWrite(char dataWrite);
char SerialRead(void);
char SerialAvailable(void);
char SerialWriteText(char *dataText);
void SerialReadText(char *Output, unsigned int lenght);
char SerialErrors(void);
char RxIdle(void);
char TxRegisterFull(void);
void SerialPrintLn(char *dataText);
void SerialPrint(char *dataText);
// TODO Insert appropriate #include <>
void ComunicationProcess(void);
void setupComunication(void);
// TODO Insert C++ class definitions if appropriate
char cocienteEntero(unsigned int numerator, unsigned int denominator);
char residuo(unsigned int numerator, unsigned int denominator);

void RobotInit(void);
void adelante(int velocidad);
void atras(int velocidad);
void izquierda(int velocidad);
void derecha(int velocidad);
void ComunicationInit(void);
char BTData(void);
void Attack(const int mode);
void WeaponInit(void);
void stop(void);
void testing(void);
void runit(void);

//Pendents
void VirtualPortWrite(int data,int portwide, int pins[]);
void VirtualDigitalWrite(int duty);

//Practicas:
 void Practica1Setup(void);
 void Practica1Loop(void);
 void Practica2Setup(void);
 void Practica2Loop(void);
 void Practica3Setup(void);
 void Practica3Loop(void);
// Comment a function and leverage automatic documentation with slash star star
/**
 * 
    <p><b>Function prototype:</b></p>
  
    <p><b>Summary:</b></p>

    <p><b>Description:</b></p>

    <p><b>Precondition:</b></p>

    <p><b>Parameters:</b></p>

    <p><b>Returns:</b></p>

    <p><b>Example:</b></p>
    <code>
 
    </code>

    <p><b>Remarks:</b></p>
 */
// TODO Insert declarations or function prototypes (right here) to leverage 
// live documentation

#ifdef	__cplusplus
extern "C" {
#endif




#ifdef	__cplusplus
}
#endif

#endif	/* SYSTEM_H */

